In [1]:
import pandas as pd
log = pd.read_csv("log.csv")

In [2]:
log = pd.read_csv("log.csv", header=None)

In [3]:
log.columns = ['user_id', 'time', "bet", "win"]

In [4]:
new_log = log[~log.user_id.str.match("#error", na=False)]

In [5]:
new_log

                              user_id                  time      bet     win
0    Запись пользователя № - user_919  [2019-01-01 14:06:51      NaN     NaN
1    Запись пользователя № - user_973  [2019-01-01 14:51:16      NaN     NaN
2    Запись пользователя № - user_903  [2019-01-01 16:31:16      NaN     NaN
3    Запись пользователя № - user_954  [2019-01-01 17:17:51      NaN     NaN
4    Запись пользователя № - user_954  [2019-01-01 21:31:18      NaN     NaN
..                                ...                   ...      ...     ...
991  Запись пользователя № - user_965  [2019-04-20 12:55:41    800.0  6927.0
992  Запись пользователя № - user_967  [2019-04-20 14:59:36  10154.0     NaN
993  Запись пользователя № - user_973  [2019-04-20 17:09:56  10254.0     NaN
994  Запись пользователя № - user_977  [2019-04-20 18:10:07  10354.0     NaN
995  Запись пользователя № - user_984   [2019-04-20 9:59:58   9754.0     NaN

[985 rows x 4 columns]

In [9]:
#Чтение третьего файла

In [6]:
sample = pd.read_csv("sample.csv")

In [7]:
sample

            Name         City  Age Profession
0         Иванов       Москва   25     Клинер
1            NaN    Волгоград   31   Менеджер
2         Иванов       Москва   25     Клинер
3        sidorov  Владивосток   43   Менеджер
4        _______        Курск   50   Водитель
5       Кузнецов         Сочи   19    Рабочий
6          Сажин       Сургут   29    Рабочий
7   Котлеревский   Йошкар-Ола   32    Рабочий
8     Завалишина    Чебоксары   36   Менеджер
9         Левина          NaN   55    Рабочий
10          Фикс         Рига   42    Рабочий

In [12]:
sample2 = pd.DataFrame(sample[sample["Age"]<30])

In [13]:
sample2

       Name    City  Age Profession
0    Иванов  Москва   25     Клинер
2    Иванов  Москва   25     Клинер
5  Кузнецов    Сочи   19    Рабочий
6     Сажин  Сургут   29    Рабочий

In [14]:
sample[(sample['Profession'] == "Рабочий") & (sample['Age']<30)]

       Name    City  Age Profession
5  Кузнецов    Сочи   19    Рабочий
6     Сажин  Сургут   29    Рабочий

In [15]:
# Создание дата фрейма sample2 для рабочих младше 30 лет

sample2 = pd.DataFrame(sample[(sample['Profession'] == "Рабочий") & (sample['Age']<30)])

In [16]:
sample2

       Name    City  Age Profession
5  Кузнецов    Сочи   19    Рабочий
6     Сажин  Сургут   29    Рабочий

In [19]:
#Функция query

In [17]:
sample.query('Age>20')

            Name         City  Age Profession
0         Иванов       Москва   25     Клинер
1            NaN    Волгоград   31   Менеджер
2         Иванов       Москва   25     Клинер
3        sidorov  Владивосток   43   Менеджер
4        _______        Курск   50   Водитель
6          Сажин       Сургут   29    Рабочий
7   Котлеревский   Йошкар-Ола   32    Рабочий
8     Завалишина    Чебоксары   36   Менеджер
9         Левина          NaN   55    Рабочий
10          Фикс         Рига   42    Рабочий

In [18]:
sample.query('Age==25')

     Name    City  Age Profession
0  Иванов  Москва   25     Клинер
2  Иванов  Москва   25     Клинер

In [19]:
sample.query('City in ["Рига","Сочи"]')

        Name  City  Age Profession
5   Кузнецов  Сочи   19    Рабочий
10      Фикс  Рига   42    Рабочий

In [20]:
sample.query('City in ["Рига", "Сочи","Чебоксары", "Сургут"] & 21<Age<50 & Profession=="Менеджер"')

         Name       City  Age Profession
8  Завалишина  Чебоксары   36   Менеджер

In [21]:
# LOG CSV
log = pd.read_csv("log.csv",header=None)
log.columns = ['user_id','time', 'bet','win']

In [22]:
log = pd.read_csv("log.csv",header=None)
log.columns = ['user_id','time', 'bet','win']

In [23]:
sample.query('City in ["Рига"] & 21<Age<50 & Profession!="Менеджер"')

    Name  City  Age Profession
10  Фикс  Рига   42    Рабочий

In [24]:
 #Функции str.match и str.contains

In [25]:
sample.Name.str.match("К", na=False)

0     False
1     False
2     False
3     False
4     False
5      True
6     False
7      True
8     False
9     False
10    False
Name: Name, dtype: bool

In [26]:
sample[sample.Name.str.match("К", na=False)]

           Name        City  Age Profession
5      Кузнецов        Сочи   19    Рабочий
7  Котлеревский  Йошкар-Ола   32    Рабочий

In [27]:
sample[~sample.Name.str.match("К", na=False)]

          Name         City  Age Profession
0       Иванов       Москва   25     Клинер
1          NaN    Волгоград   31   Менеджер
2       Иванов       Москва   25     Клинер
3      sidorov  Владивосток   43   Менеджер
4      _______        Курск   50   Водитель
6        Сажин       Сургут   29    Рабочий
8   Завалишина    Чебоксары   36   Менеджер
9       Левина          NaN   55    Рабочий
10        Фикс         Рига   42    Рабочий

In [30]:
sample = pd.read_csv("sample.csv")

In [31]:
sample3 = sample[sample.City.str.contains("о", na=False)]

In [32]:
# ~ все значения, которые условию не удовлетворяют

In [33]:
sample4 = sample[~sample.City.str.contains("о", na=False)]

In [34]:
sample4

       Name    City  Age Profession
4   _______   Курск   50   Водитель
6     Сажин  Сургут   29    Рабочий
9    Левина     NaN   55    Рабочий
10     Фикс    Рига   42    Рабочий

In [35]:
# Преобразование данных

In [36]:
sample.Age.apply(lambda x:x**2) # возведение возраста в квадрат

0      625
1      961
2      625
3     1849
4     2500
5      361
6      841
7     1024
8     1296
9     3025
10    1764
Name: Age, dtype: int64

In [37]:
# обнулим значения возраста для всех возрастов больше 19
def func(x):
    if x<20:
        return x
    else:
        return 0
sample.Age.apply(func)

0      0
1      0
2      0
3      0
4      0
5     19
6      0
7      0
8      0
9      0
10     0
Name: Age, dtype: int64

In [38]:
sample.Age.apply(lambda x:x+1)

0     26
1     32
2     26
3     44
4     51
5     20
6     30
7     33
8     37
9     56
10    43
Name: Age, dtype: int64

In [39]:
sample2 = pd.DataFrame(sample.Age.apply(lambda x:x+1))

In [40]:
sample3 = pd.DataFrame(sample.City.apply(lambda x: str().lower()))

In [41]:
sample3

   City
0
1
2
3
4
5
6
7
8
9
10

In [42]:
b = 30
def age_category(age):
    if age<=23:
        return "молодой"
    if age>23 and age<35:
        return "средний"
    if age>=35:
        return "зрелый"
print(age_category(39))

зрелый

In [43]:
sample['Age_category'] = sample.Age.apply(age_category)#Применение функции

In [44]:
sample

            Name         City  Age Profession Age_category
0         Иванов       Москва   25     Клинер      средний
1            NaN    Волгоград   31   Менеджер      средний
2         Иванов       Москва   25     Клинер      средний
3        sidorov  Владивосток   43   Менеджер       зрелый
4        _______        Курск   50   Водитель       зрелый
5       Кузнецов         Сочи   19    Рабочий      молодой
6          Сажин       Сургут   29    Рабочий      средний
7   Котлеревский   Йошкар-Ола   32    Рабочий      средний
8     Завалишина    Чебоксары   36   Менеджер       зрелый
9         Левина          NaN   55    Рабочий       зрелый
10          Фикс         Рига   42    Рабочий       зрелый

In [42]:
def profession_code(profession):
    if profession == "Рабочий":
        return "0"
    if profession == "Менеджер":
        return "1"
    else:
        return "2"

    
    
    
print(profession_code("Вахтовик"))

2